In [1]:
#Dependencies
import pandas as pd
import glob
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
#Check all the csv's
death_files = glob.glob("Resources/*.csv")
death_files

['Resources/Deaths_State_CandR.csv', 'Resources/Deaths_National_CandR.csv']

In [3]:
#Read in the csv's
death_nat = pd.read_csv('Resources/Deaths_National_CandR.csv') 
death_st = pd.read_csv('Resources/Deaths_State_CandR.csv')
death_nat.head()

,Geography,2008,Unnamed: 2,2009,Unnamed: 4,2010,Unnamed: 6,2011,Unnamed: 8,2012,...,2013,Unnamed: 12,2014,Unnamed: 14,2015,Unnamed: 16,2016,Unnamed: 18,2017,Unnamed: 20
0,NaN,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,...,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000
1,US,"18,544",7.4,"18,064",7.1,"16,774",6.5,"16,331",6.3,"16,034",...,"15,917",6,"16,148",6.1,"15,859",5.9,"16,334",6,"15,969",5.9

In [4]:
#Rename column headers of the national
death_nat = death_nat.rename(columns= {'2008':'Deaths_08','Unnamed: 2':'Death_Rate_08','2009':'Deaths_09','Unnamed: 4':'Death_Rate_09',
                                           '2010':'Deaths_10','Unnamed: 6':'Death_Rate_10','2011':'Deaths_11','Unnamed: 8':'Death_Rate_11',
                                           '2012':'Deaths_12','Unnamed: 10':'Death_Rate_12','2013':'Deaths_13','Unnamed: 12':'Death_Rate_13',
                                           '2014':'Deaths_14','Unnamed: 14':'Death_Rate_14','2015':'Deaths_15','Unnamed: 16':'Death_Rate_15',
                                           '2016':'Deaths_16','Unnamed: 18':'Death_Rate_16','2017':'Deaths_17','Unnamed: 20':'Death_Rate_17'})
death_nat.head()

,Geography,Deaths_08,Death_Rate_08,Deaths_09,Death_Rate_09,Deaths_10,Death_Rate_10,Deaths_11,Death_Rate_11,Deaths_12,...,Deaths_13,Death_Rate_13,Deaths_14,Death_Rate_14,Deaths_15,Death_Rate_15,Deaths_16,Death_Rate_16,Deaths_17,Death_Rate_17
0,NaN,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,...,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000,Cases,Rate per 100000
1,US,"18,544",7.4,"18,064",7.1,"16,774",6.5,"16,331",6.3,"16,034",...,"15,917",6,"16,148",6.1,"15,859",5.9,"16,334",6,"15,969",5.9

In [5]:
#Remove unwanted row , add new 'Type' column, and rename 'Geography'
death_nat_df = death_nat.iloc[1:].rename(columns={'Geography':'Name'})
death_nat_df['Type'] = 'National'
death_nat_df

,Name,Deaths_08,Death_Rate_08,Deaths_09,Death_Rate_09,Deaths_10,Death_Rate_10,Deaths_11,Death_Rate_11,Deaths_12,...,Death_Rate_13,Deaths_14,Death_Rate_14,Deaths_15,Death_Rate_15,Deaths_16,Death_Rate_16,Deaths_17,Death_Rate_17,Type
1,US,"18,544",7.4,"18,064",7.1,"16,774",6.5,"16,331",6.3,"16,034",...,6,"16,148",6.1,"15,859",5.9,"16,334",6,"15,969",5.9,National

In [6]:
#Pivot tabel
death_rate_piv = death_st.pivot(index='Geography',columns='Year',values='Rate per 100000')
death_rate_piv = death_rate_piv.reset_index()
death_rate_piv.head()

Year   Geography  2008  2009  2010  2011  2012  2013  2014  2015  2016  2017
0        Alabama   7.4   8.0   6.9   6.4   7.0   6.0   6.9   6.8   6.5   6.0
1         Alaska   3.8   2.3   2.8   2.1   1.9   2.7   2.0   2.0   2.2   1.3
2        Arizona   4.5   4.0   3.8   3.6   3.9   3.9   4.0   3.8   4.2   3.4
3       Arkansas   4.8   4.7   4.7   4.6   3.7   4.9   4.9   4.5   3.8   4.2
4     California   6.0   5.4   5.0   5.2   5.0   5.1   5.1   5.2   5.4   5.2

In [7]:
death_rate_rename = death_rate_piv.rename(columns= {'Geography':'Name',2008:'Death_Rate_08',2009:'Death_Rate_09',2010:'Death_Rate_10',2011:'Death_Rate_11',
                                            2012:'Death_Rate_12',2013:'Death_Rate_13',2014:'Death_Rate_14',2015:'Death_Rate_15',
                                           2016:'Death_Rate_16',2017:'Death_Rate_17'})
death_rate_rename.head()

Year,Name,Death_Rate_08,Death_Rate_09,Death_Rate_10,Death_Rate_11,Death_Rate_12,Death_Rate_13,Death_Rate_14,Death_Rate_15,Death_Rate_16,Death_Rate_17
0,Alabama,7.4,8.0,6.9,6.4,7.0,6.0,6.9,6.8,6.5,6.0
1,Alaska,3.8,2.3,2.8,2.1,1.9,2.7,2.0,2.0,2.2,1.3
2,Arizona,4.5,4.0,3.8,3.6,3.9,3.9,4.0,3.8,4.2,3.4
3,Arkansas,4.8,4.7,4.7,4.6,3.7,4.9,4.9,4.5,3.8,4.2
4,California,6.0,5.4,5.0,5.2,5.0,5.1,5.1,5.2,5.4,5.2

In [8]:
death_cases_piv = death_st.pivot(index='Geography',columns='Year',values='Cases')
death_cases_piv = death_cases_piv.reset_index()
death_cases_piv.head()

Year,Geography,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017
0,Alabama,288,310,274,255,281,244,279,276,266,244
1,Alaska,21,13,16,12,11,16,12,12,13,8
2,Arizona,233,213,199,191,211,214,220,213,242,197
3,Arkansas,113,112,114,111,90,120,120,110,94,104
4,California,"1,777","1,632","1,543","1,605","1,555","1,607","1,635","1,698","1,765","1,708"

In [9]:
death_cases_rename = death_cases_piv.rename(columns= {'Geography':'Name',2008:'Deaths_08',2009:'Deaths_09',2010:'Deaths_10',2011:'Deaths_11',
                2012:'Deaths_12',2013:'Deaths_13',2014:'Deaths_14',2015:'Deaths_15',
                2016:'Deaths_16',2017:'Deaths_17'})
death_cases_rename.head()

Year,Name,Deaths_08,Deaths_09,Deaths_10,Deaths_11,Deaths_12,Deaths_13,Deaths_14,Deaths_15,Deaths_16,Deaths_17
0,Alabama,288,310,274,255,281,244,279,276,266,244
1,Alaska,21,13,16,12,11,16,12,12,13,8
2,Arizona,233,213,199,191,211,214,220,213,242,197
3,Arkansas,113,112,114,111,90,120,120,110,94,104
4,California,"1,777","1,632","1,543","1,605","1,555","1,607","1,635","1,698","1,765","1,708"

In [10]:
death_st_df = pd.merge(death_cases_rename,death_rate_rename,how='outer',on='Name')
#Place in the same order as national so to concat
death_st_df = death_st_df[['Name','Deaths_08','Death_Rate_08','Deaths_09','Death_Rate_09','Deaths_10','Death_Rate_10','Deaths_11','Death_Rate_11',
                                   'Deaths_12','Death_Rate_12','Deaths_13','Death_Rate_13','Deaths_14','Death_Rate_14','Deaths_15','Death_Rate_15',
                                   'Deaths_16','Death_Rate_16','Deaths_17','Death_Rate_17']]
death_st_df['Type'] = 'State'
death_st_df.head()

Year,Name,Deaths_08,Death_Rate_08,Deaths_09,Death_Rate_09,Deaths_10,Death_Rate_10,Deaths_11,Death_Rate_11,Deaths_12,...,Death_Rate_13,Deaths_14,Death_Rate_14,Deaths_15,Death_Rate_15,Deaths_16,Death_Rate_16,Deaths_17,Death_Rate_17,Type
0,Alabama,288,7.4,310,8.0,274,6.9,255,6.4,281,...,6.0,279,6.9,276,6.8,266,6.5,244,6.0,State
1,Alaska,21,3.8,13,2.3,16,2.8,12,2.1,11,...,2.7,12,2.0,12,2.0,13,2.2,8,1.3,State
2,Arizona,233,4.5,213,4.0,199,3.8,191,3.6,211,...,3.9,220,4.0,213,3.8,242,4.2,197,3.4,State
3,Arkansas,113,4.8,112,4.7,114,4.7,111,4.6,90,...,4.9,120,4.9,110,4.5,94,3.8,104,4.2,State
4,California,"1,777",6.0,"1,632",5.4,"1,543",5.0,"1,605",5.2,"1,555",...,5.1,"1,635",5.1,"1,698",5.2,"1,765",5.4,"1,708",5.2,State

In [11]:
deaths_df = pd.concat([death_nat_df,death_st_df])
deaths_df = deaths_df[['Name','Type','Deaths_08','Death_Rate_08','Deaths_09','Death_Rate_09','Deaths_10','Death_Rate_10','Deaths_11','Death_Rate_11',
                      'Deaths_12','Death_Rate_12','Deaths_13','Death_Rate_13','Deaths_14','Death_Rate_14','Deaths_15','Death_Rate_15',
                      'Deaths_16','Death_Rate_16','Deaths_17','Death_Rate_17']]
deaths_df.head()

Year,Name,Type,Deaths_08,Death_Rate_08,Deaths_09,Death_Rate_09,Deaths_10,Death_Rate_10,Deaths_11,Death_Rate_11,...,Deaths_13,Death_Rate_13,Deaths_14,Death_Rate_14,Deaths_15,Death_Rate_15,Deaths_16,Death_Rate_16,Deaths_17,Death_Rate_17
1,US,National,"18,544",7.4,"18,064",7.1,"16,774",6.5,"16,331",6.3,...,"15,917",6,"16,148",6.1,"15,859",5.9,"16,334",6,"15,969",5.9
0,Alabama,State,288,7.4,310,8,274,6.9,255,6.4,...,244,6,279,6.9,276,6.8,266,6.5,244,6
1,Alaska,State,21,3.8,13,2.3,16,2.8,12,2.1,...,16,2.7,12,2,12,2,13,2.2,8,1.3
2,Arizona,State,233,4.5,213,4,199,3.8,191,3.6,...,214,3.9,220,4,213,3.8,242,4.2,197,3.4
3,Arkansas,State,113,4.8,112,4.7,114,4.7,111,4.6,...,120,4.9,120,4.9,110,4.5,94,3.8,104,4.2

In [14]:
ddeaths_df.to_csv("Output/overall_deaths.csv",index=False)